status/2021/20aug21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>14 August 2021 - 20 August 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">14 August 2021 - 20 August 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org07cc921">1. MIT OCW</a>
<ul>
<li><a href="#org085a4ec">1.1. 18.01 - Single Variable Calculus</a>
<ul>
<li><a href="#org99abe17">1.1.1. CRC problems</a></li>
</ul>
</li>
<li><a href="#org84e10c7">1.2. 8.01 - Physics I - Classical Mechanics</a></li>
</ul>
</li>
<li><a href="#org75db5b0">2. US index Map</a></li>
<li><a href="#orgec653e9">3. Marble Computation</a>
<ul>
<li><a href="#orge3a7373">3.1. Next Steps</a>
<ul>
<li><a href="#orgbaaf7be">3.1.1. Continue Reversible Computation Study</a></li>
<li><a href="#org7eff14c">3.1.2. Prototype Marble inverter</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org40562d3">4. Sun Ultra 10</a>
<ul>
<li><a href="#orgdbee8d7">4.1. Next steps</a>
<ul>
<li><a href="#org3eaa3f5">4.1.1. Serial debug</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2eb20e8">5. Apple iMac G4</a>
<ul>
<li><a href="#org25762da">5.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org5d13439">6. Davies Brothel</a></li>
<li><a href="#orga897d87">7. Linux Audio</a>
<ul>
<li><a href="#org958427e">7.1. pvanal to spectrogram</a>
<ul>
<li><a href="#orgee9fecd">7.1.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org1de008c">7.2. CSound programming.</a>
<ul>
<li><a href="#org79515b5">7.2.1. Next Steps</a></li>
</ul>
</li>
<li><a href="#orgda9a991">7.3. Faust programming</a>
<ul>
<li><a href="#orgc058357">7.3.1. Next Steps</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1d4e3d5">8. EPICS</a>
<ul>
<li><a href="#org99f2447">8.1. Next steps</a>
<ul>
<li><a href="#org876eea5">8.1.1. u3scpi network port testing</a></li>
<li><a href="#org482889f">8.1.2. initial EPICS interface</a></li>
<li><a href="#org581cbea">8.1.3. u3scpi analog/digital port reconfiguration.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3d347e9">9. Brini Tracker II</a>
<ul>
<li><a href="#org2422f4b">9.1. Next steps</a>
<ul>
<li><a href="#orge92ec04">9.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#orgf85f57d">9.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#org4b2024e">9.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd2e21d3">10. wktcolor</a>
<ul>
<li><a href="#org2241572">10.1. Next steps</a>
<ul>
<li><a href="#orgea46512">10.1.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge347e19">11. wktplot</a>
<ul>
<li><a href="#orgb87c553">11.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org120ab69">12. AMDGPU</a>
<ul>
<li><a href="#org1a6e964">12.1. Next step</a>
<ul>
<li><a href="#orge2d76db">12.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc725831">13. Ninja v Make</a>
<ul>
<li><a href="#org0953cd8">13.1. Next Step</a>
<ul>
<li><a href="#org316078f">13.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga071253">14. GMP Forth</a>
<ul>
<li><a href="#org6e9a1fb">14.1. Need to think about adding floating point support</a></li>
<li><a href="#orga5a6f1c">14.2. Port to non-Linux OS</a></li>
</ul>
</li>
<li><a href="#org43846fd">15. ca-r</a>
<ul>
<li><a href="#org4f2c48d">15.1. Next Step</a></li>
</ul>
</li>
<li><a href="#orgfc06bc6">16. Swocer</a>
<ul>
<li><a href="#orgcf35172">16.1. Most crashing addressed</a></li>
<li><a href="#orgff2ecfa">16.2. Added outline for 'bottle' test</a></li>
<li><a href="#orgc75bf4a">16.3. Next steps</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
First week of class (sorta)
</p>

<div id="outline-container-org07cc921" class="outline-2">
<h2 id="org07cc921"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org085a4ec" class="outline-3">
<h3 id="org085a4ec"><span class="section-number-3">1.1.</span> 18.01 - Single Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Completed sessions 1-9
</p>
</div>
<div id="outline-container-org99abe17" class="outline-4">
<h4 id="org99abe17"><span class="section-number-4">1.1.1.</span> CRC problems</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
May have found some errors in Math CRC 30th ed. "Circular Functions
of Some Special Angles": shows sin(2*pi/3)=1/2, not sqrt(3)/2.  Not
listed in errata; Need to check all values. Not the first time I've
been led astray by Math CRC.
</p>
</div>
</div>
</div>
<div id="outline-container-org84e10c7" class="outline-3">
<h3 id="org84e10c7"><span class="section-number-3">1.2.</span> 8.01 - Physics I - Classical Mechanics</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Completed Week 1; need to finish problem set 1
</p>
</div>
</div>
</div>
<div id="outline-container-org75db5b0" class="outline-2">
<h2 id="org75db5b0"><span class="section-number-2">2.</span> US index Map</h2>
<div class="outline-text-2" id="text-2">
<p>
Sister Maureen needs some help with a US index map for geography
dept.  map collection. Started looking seeing if GMT is faster to
figure out than GRASS.
</p>
</div>
</div>
<div id="outline-container-orgec653e9" class="outline-2">
<h2 id="orgec653e9"><span class="section-number-2">3.</span> Marble Computation</h2>
<div class="outline-text-2" id="text-3">
<p>
Collected materials (thin copper plate, copper PCB blanks) for prototyping.
</p>
</div>
<div id="outline-container-orge3a7373" class="outline-3">
<h3 id="orge3a7373"><span class="section-number-3">3.1.</span> Next Steps</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgbaaf7be" class="outline-4">
<h4 id="orgbaaf7be"><span class="section-number-4">3.1.1.</span> Continue Reversible Computation Study</h4>
</div>
<div id="outline-container-org7eff14c" class="outline-4">
<h4 id="org7eff14c"><span class="section-number-4">3.1.2.</span> Prototype Marble inverter</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Using dual rail differential logic (left/,right/1), an inverter
merely switches sides. I think little "kickers" on the side should
be sufficient for a purely mechanical approach.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org40562d3" class="outline-2">
<h2 id="org40562d3"><span class="section-number-2">4.</span> Sun Ultra 10</h2>
<div class="outline-text-2" id="text-4">
<p>
Trying to see what state it is in. Fires up but no video. Need DB25M to
debug over serial port.
</p>
</div>
<div id="outline-container-orgdbee8d7" class="outline-3">
<h3 id="orgdbee8d7"><span class="section-number-3">4.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org3eaa3f5" class="outline-4">
<h4 id="org3eaa3f5"><span class="section-number-4">4.1.1.</span> Serial debug</h4>
</div>
</div>
</div>
<div id="outline-container-org2eb20e8" class="outline-2">
<h2 id="org2eb20e8"><span class="section-number-2">5.</span> Apple iMac G4</h2>
<div class="outline-text-2" id="text-5">
<p>
Building userland may be a PITA due to lack of RAM. Build would often
segfault.
</p>
</div>
<div id="outline-container-org25762da" class="outline-3">
<h3 id="org25762da"><span class="section-number-3">5.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Not sure.
</p>
</div>
</div>
</div>

<div id="outline-container-org5d13439" class="outline-2">
<h2 id="org5d13439"><span class="section-number-2">6.</span> Davies Brothel</h2>
<div class="outline-text-2" id="text-6">
<p>
Next hearing: 02 September; Department 37
</p>
</div>
</div>
<div id="outline-container-orga897d87" class="outline-2">
<h2 id="orga897d87"><span class="section-number-2">7.</span> Linux Audio</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org958427e" class="outline-3">
<h3 id="org958427e"><span class="section-number-3">7.1.</span> pvanal to spectrogram</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Enough of libriffr and libpvocf work to start pvoctool
<a href="https://github.com/daniel-kelley/pvoctool">https://github.com/daniel-kelley/pvoctool</a>. Have HDF5 output and
text delimited output for octave. Can import PVOC data to octave
spectrogram for display.
</p>
</div>
<div id="outline-container-orgee9fecd" class="outline-4">
<h4 id="orgee9fecd"><span class="section-number-4">7.1.1.</span> Next steps</h4>
<div class="outline-text-4" id="text-7-1-1">
<p>
Loop analysis
</p>
</div>
</div>
</div>
<div id="outline-container-org1de008c" class="outline-3">
<h3 id="org1de008c"><span class="section-number-3">7.2.</span> CSound programming.</h3>
<div class="outline-text-3" id="text-7-2">
<p>
The FORTRAN of computer music. Getting up to speed.
</p>
</div>
<div id="outline-container-org79515b5" class="outline-4">
<h4 id="org79515b5"><span class="section-number-4">7.2.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-7-2-1">
</div>
<ol class="org-ol">
<li><a id="orge6327fb"></a>loscil demo<br /></li>
<li><a id="orgf056689"></a>spectrogram loop point analysis<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgda9a991" class="outline-3">
<h3 id="orgda9a991"><span class="section-number-3">7.3.</span> Faust programming</h3>
<div class="outline-text-3" id="text-7-3">
</div>
<div id="outline-container-orgc058357" class="outline-4">
<h4 id="orgc058357"><span class="section-number-4">7.3.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-7-3-1">
</div>
<ol class="org-ol">
<li><a id="orga147acf"></a>GAC Patch save/restore<br /></li>
<li><a id="org7722776"></a>LV2 autopatcher<br />
<div class="outline-text-5" id="text-7-3-1-2">
<p>
Exploratory tool to generate (was pd, ecasound, now carla) patch for arbitrary LV2 plugin:
hook up audio inputs to signal source, audio outputs to speakers, control inputs to
control surface, etc.
</p>
</div>
</li>
<li><a id="org438c0f3"></a>OSC control surface<br />
<div class="outline-text-5" id="text-7-3-1-3">
<p>
Some sort of GUI tool (knob/slider) to OSC messages. This may be
as simple as a Faust UI program.
</p>
</div>
</li>
<li><a id="org436ab48"></a>Faust/csound<br />
<div class="outline-text-5" id="text-7-3-1-4">
<p>
See if a faust generated unit works.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org1d4e3d5" class="outline-2">
<h2 id="org1d4e3d5"><span class="section-number-2">8.</span> EPICS</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org99f2447" class="outline-3">
<h3 id="org99f2447"><span class="section-number-3">8.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org876eea5" class="outline-4">
<h4 id="org876eea5"><span class="section-number-4">8.1.1.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-org482889f" class="outline-4">
<h4 id="org482889f"><span class="section-number-4">8.1.2.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-org581cbea" class="outline-4">
<h4 id="org581cbea"><span class="section-number-4">8.1.3.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
</div>
</div>

<div id="outline-container-org3d347e9" class="outline-2">
<h2 id="org3d347e9"><span class="section-number-2">9.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-9">
<p>
Suspended for now.
</p>
</div>
<div id="outline-container-org2422f4b" class="outline-3">
<h3 id="org2422f4b"><span class="section-number-3">9.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-orge92ec04" class="outline-4">
<h4 id="orge92ec04"><span class="section-number-4">9.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-orgf85f57d" class="outline-4">
<h4 id="orgf85f57d"><span class="section-number-4">9.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-org4b2024e" class="outline-4">
<h4 id="org4b2024e"><span class="section-number-4">9.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>

<div id="outline-container-orgd2e21d3" class="outline-2">
<h2 id="orgd2e21d3"><span class="section-number-2">10.</span> wktcolor</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org2241572" class="outline-3">
<h3 id="org2241572"><span class="section-number-3">10.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-10-1">
</div>
<div id="outline-container-orgea46512" class="outline-4">
<h4 id="orgea46512"><span class="section-number-4">10.1.1.</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-10-1-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orge347e19" class="outline-2">
<h2 id="orge347e19"><span class="section-number-2">11.</span> wktplot</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgb87c553" class="outline-3">
<h3 id="orgb87c553"><span class="section-number-3">11.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
Explore biological cell Voronoi organization
</p>
</div>
</div>
</div>

<div id="outline-container-org120ab69" class="outline-2">
<h2 id="org120ab69"><span class="section-number-2">12.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org1a6e964" class="outline-3">
<h3 id="org1a6e964"><span class="section-number-3">12.1.</span> Next step</h3>
<div class="outline-text-3" id="text-12-1">
</div>
<div id="outline-container-orge2d76db" class="outline-4">
<h4 id="orge2d76db"><span class="section-number-4">12.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>

<div id="outline-container-orgc725831" class="outline-2">
<h2 id="orgc725831"><span class="section-number-2">13.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org0953cd8" class="outline-3">
<h3 id="org0953cd8"><span class="section-number-3">13.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-13-1">
</div>
<div id="outline-container-org316078f" class="outline-4">
<h4 id="org316078f"><span class="section-number-4">13.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>

<div id="outline-container-orga071253" class="outline-2">
<h2 id="orga071253"><span class="section-number-2">14.</span> GMP Forth</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org6e9a1fb" class="outline-3">
<h3 id="org6e9a1fb"><span class="section-number-3">14.1.</span> Need to think about adding floating point support</h3>
</div>
<div id="outline-container-orga5a6f1c" class="outline-3">
<h3 id="orga5a6f1c"><span class="section-number-3">14.2.</span> Port to non-Linux OS</h3>
</div>
</div>
<div id="outline-container-org43846fd" class="outline-2">
<h2 id="org43846fd"><span class="section-number-2">15.</span> ca-r</h2>
<div class="outline-text-2" id="text-15">
<p>
Tier data finally deprecated so processing is removed.
</p>
</div>
<div id="outline-container-org4f2c48d" class="outline-3">
<h3 id="org4f2c48d"><span class="section-number-3">15.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-15-1">
<p>
None.
</p>
</div>
</div>
</div>
<div id="outline-container-orgfc06bc6" class="outline-2">
<h2 id="orgfc06bc6"><span class="section-number-2">16.</span> Swocer</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-orgcf35172" class="outline-3">
<h3 id="orgcf35172"><span class="section-number-3">16.1.</span> Most crashing addressed</h3>
<div class="outline-text-3" id="text-16-1">
<p>
Nullified 'handle' API free functions helped a lot.
Still see some errors in operations.
</p>
</div>
</div>
<div id="outline-container-orgff2ecfa" class="outline-3">
<h3 id="orgff2ecfa"><span class="section-number-3">16.2.</span> Added outline for 'bottle' test</h3>
<div class="outline-text-3" id="text-16-2">
<p>
Added all functions believed to be needed for 'bottle' demo test.
Test doesn't pass so is disabled.
</p>
</div>
</div>
<div id="outline-container-orgc75bf4a" class="outline-3">
<h3 id="orgc75bf4a"><span class="section-number-3">16.3.</span> Next steps</h3>
<div class="outline-text-3" id="text-16-3">
<p>
Swocer future.
Check out what's needed for gears.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>